Project/Toir.Adaptation/src/Reports/торо_ПлановыеВнеплановыеРемонты/торо_ПлановыеВнеплановыеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3c61c94d-6f97-43b7-83fe-e250d64c6842">
  <name>торо_ПлановыеВнеплановыеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешниеОснованияДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>СписокОбъектов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗавершенныеМероприятия/торо_ЗавершенныеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗавершенныеМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>СписокОбъектов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СписокОбъектов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Reports/торо_ПлановыеВнеплановыеРемонты/ObjectModule.bsl
&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура гкс_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);

	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяСтруктураИерархии",
		Справочники.торо_СтруктурыОР.ПустаяСсылка());

		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;

	КонецЕсли;

	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаКон", "НаборДанныхПланВнеплан");

	Если ТекИерархия.СтроитсяАвтоматически Тогда

		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхПланВнеплан.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Итог.РассчитыватьВремя КАК РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Итог.ИД КАК ИД,
		|	ВТ_Итог.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор КАК ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ВТ_Итог.Ремонт КАК Ремонт,
		|	ВТ_Итог.ДокументАкт КАК ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения КАК СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта КАК ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта КАК ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции КАК ВремяРеакции,
		|	ВТ_Итог.Смета КАК Смета,
		#Вставка
		// гкс+ [Релиз18] Деснол
		|	ВТ_Итог.НаработкаАкта КАК НаработкаАкта,
		|	ВТ_Итог.Комментарий КАК Комментарий,
		// гкс- [Релиз18]
		#КонецВставки
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Итог.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Итог.РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта,
		|	ВТ_Итог.ИД,
		|	ВТ_Итог.ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения,
		|	ВТ_Итог.Ремонт,
		|	ВТ_Итог.ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции,
		|	ВТ_Итог.Смета,
		#Вставка
		// гкс+ [Релиз18] Деснол
		|	ВТ_Итог.НаработкаАкта КАК НаработкаАкта,
		|	ВТ_Итог.Комментарий КАК Комментарий,
		// гкс- [Релиз18]
		#КонецВставки
		|	ЗНАЧЕНИЕ(Справочник." + ТекИерархия.ТипРеквизитаОР + ".ПустаяСсылка)
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	НЕ ВТ_Итог.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта";

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);

	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхПланВнеплан.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Итог.РассчитыватьВремя КАК РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Итог.ИД КАК ИД,
		|	ВТ_Итог.ПлановаяДатаНачала КАК ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания КАК ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала КАК ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания КАК ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор КАК ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ВТ_Итог.Ремонт КАК Ремонт,
		|	ВТ_Итог.ДокументАкт КАК ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения КАК СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта КАК ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта КАК ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции КАК ВремяРеакции,
		|	ВТ_Итог.Смета КАК Смета,
		#Вставка
		// гкс+ [Релиз18] Деснол
		|	ВТ_Итог.НаработкаАкта КАК НаработкаАкта,
		|	ВТ_Итог.Комментарий КАК Комментарий,
		// гкс- [Релиз18]
		#КонецВставки
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Итог.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Итог.РассчитыватьВремя,
		|	ВТ_Итог.ОбъектРемонта,
		|	ВТ_Итог.ИД,
		|	ВТ_Итог.ПлановаяДатаНачала,
		|	ВТ_Итог.ПлановаяДатаОкончания,
		|	ВТ_Итог.ФактическаяДатаНачала,
		|	ВТ_Итог.ФактическаяДатаОкончания,
		|	ВТ_Итог.ДокИнициатор,
		|	ВТ_Итог.ДатаОбнаружения,
		|	ВТ_Итог.Ремонт,
		|	ВТ_Итог.ДокументАкт,
		|	ВТ_Итог.СтатусВыполнения,
		|	ВТ_Итог.ДлительностьРемонта,
		|	ВТ_Итог.ДлительностьУстраненияДефекта,
		|	ВТ_Итог.ВремяРеакции,
		|	ВТ_Итог.Смета,
		#Вставка
		// гкс+ [Релиз18] Деснол
		|	ВТ_Итог.НаработкаАкта КАК НаработкаАкта,
		|	ВТ_Итог.Комментарий КАК Комментарий,
		// гкс- [Релиз18]
		#КонецВставки
		|	ВТ_Итог.ОбъектРемонта
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	НЕ ВТ_Итог.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта";

	КонецЕсли;

	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	дс_ДобавитьПараметрыВСКД();
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьСодержательнуюЧастьЗапроса")
Функция гкс_ПолучитьСодержательнуюЧастьЗапроса()

	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	табВД.ОтказавшийЭлемент КАК ОбъектРемонта,
	|	табВД.ID КАК ИД,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПланДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	табВД.Регистратор КАК ДокИнициатор,
	|	табВД.Период КАК ДатаОбнаружения,
	|	торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение КАК ВидРемонта
	|ПОМЕСТИТЬ табВД
	|ИЗ
	|	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, &РассчетРемонтовПоДефектам = ИСТИНА) КАК табВД,
	|	Константа.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	табВО.ОбъектРемонта КАК ОбъектРемонта,
	|	табВО.ID КАК ИД,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПланДатаНач,
	|	табВО.ПлановаяДатаРемонта КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	табВО.Регистратор КАК ДокИнициатор,
	|	табВО.Период КАК ДатаОбнаружения,
	|	торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение КАК ВидРемонта
	|ПОМЕСТИТЬ табВО_безДаты
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(
	|			,
	|			&РассчетРемонтовПоВнешнимОснованиям = ИСТИНА
	|				И НЕ ID В
	|						(ВЫБРАТЬ
	|							Таб.ИД
	|						ИЗ
	|							табВД КАК Таб)) КАК табВО,
	|	Константа.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокИнициатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	таб.ОбъектРемонта КАК ОбъектРемонта,
	|	таб.ИД КАК ИД,
	|	таб.ПланДатаНач КАК ПланДатаНач,
	|	таб.ПланДатаКон КАК ПланДатаКон,
	|	таб.ФактДатаНач КАК ФактДатаНач,
	|	таб.ФактДатаКон КАК ФактДатаКон,
	|	таб.ДокИнициатор КАК ДокИнициатор,
	|	табДокументов.ДатаСоздания КАК ДатаОбнаружения,
	|	таб.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ табВО
	|ИЗ
	|	табВО_безДаты КАК таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот КАК табДокументов
	|		ПО таб.ДокИнициатор = табДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонта,
	|	торо_ПланГрафикРемонта.ID КАК ИД,
	|	торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот КАК ПланДатаНач,
	|	торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	торо_ПланГрафикРемонта.Регистратор КАК ДокИнициатор,
	|	торо_ПланГрафикРемонта.Период КАК ДатаОбнаружения,
	|	торо_ПланГрафикРемонта.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ табППР
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, &РассчетПланГрафиковППР = ИСТИНА) КАК торо_ПланГрафикРемонта
	|ГДЕ
	|	торо_ПланГрафикРемонта.Отменен = ЛОЖЬ
	|	И торо_ПланГрафикРемонта.Замещен = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК РассчитыватьВремя,
	|	табВД.ОбъектРемонта КАК ОбъектРемонта,
	|	табВД.ИД КАК ИД,
	|	табВД.ПланДатаНач КАК ПланДатаНач,
	|	табВД.ПланДатаКон КАК ПланДатаКон,
	|	табВД.ФактДатаНач КАК ФактДатаНач,
	|	табВД.ФактДатаКон КАК ФактДатаКон,
	|	табВД.ДокИнициатор КАК ДокИнициатор,
	|	табВД.ДатаОбнаружения КАК ДатаОбнаружения,
	|	табВД.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ табНЕРегламенты
	|ИЗ
	|	табВД КАК табВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	табВО.ОбъектРемонта,
	|	табВО.ИД,
	|	табВО.ПланДатаНач,
	|	табВО.ПланДатаКон,
	|	табВО.ФактДатаНач,
	|	табВО.ФактДатаКон,
	|	табВО.ДокИнициатор,
	|	табВО.ДатаОбнаружения,
	|	табВО.ВидРемонта
	|ИЗ
	|	табВО КАК табВО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	табППР.ОбъектРемонта,
	|	табППР.ИД,
	|	табППР.ПланДатаНач,
	|	табППР.ПланДатаКон,
	|	табППР.ФактДатаНач,
	|	табППР.ФактДатаКон,
	|	табППР.ДокИнициатор,
	|	табППР.ДатаОбнаружения,
	|	табППР.ВидРемонта
	|ИЗ
	|	табППР КАК табППР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табВД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табВО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табППР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтыСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыСрезПоследних.ID КАК ИД,
	|	торо_РемонтыСрезПоследних.ДатаНачалаПлан КАК ПланДатаНач,
	|	торо_РемонтыСрезПоследних.ДатаОкончанияПлан КАК ПланДатаКон,
	|	торо_РемонтыСрезПоследних.ДатаНачалаФакт КАК ФактДатаНач,
	|	торо_РемонтыСрезПоследних.ДатаОкончанияФакт КАК ФактДатаКон,
	|	НЕОПРЕДЕЛЕНО КАК ДатаОбнаружения,
	|	торо_РемонтыСрезПоследних.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыСрезПоследних.Регистратор КАК Смета
	|ПОМЕСТИТЬ Сметы
	|ИЗ
	|	РегистрСведений.торо_Ремонты.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт) КАК торо_РемонтыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	табНЕРегламенты.РассчитыватьВремя КАК РассчитыватьВремя,
	|	табНЕРегламенты.ОбъектРемонта КАК ОбъектРемонта,
	|	табНЕРегламенты.ИД КАК ИД,
	|	ЕСТЬNULL(Сметы.ПланДатаНач, табНЕРегламенты.ПланДатаНач) КАК ПланДатаНач,
	|	ЕСТЬNULL(Сметы.ПланДатаКон, табНЕРегламенты.ПланДатаКон) КАК ПланДатаКон,
	|	ЕСТЬNULL(Сметы.ФактДатаНач, табНЕРегламенты.ФактДатаНач) КАК ФактДатаНач,
	|	ЕСТЬNULL(Сметы.ФактДатаКон, табНЕРегламенты.ФактДатаКон) КАК ФактДатаКон,
	|	табНЕРегламенты.ДокИнициатор КАК ДокИнициатор,
	|	табНЕРегламенты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ЕСТЬNULL(Сметы.ВидРемонта, табНЕРегламенты.ВидРемонта) КАК ВидРемонта,
	|	Сметы.Смета КАК Смета
	|ПОМЕСТИТЬ НеРегламенты_ПлановыеДаты
	|ИЗ
	|	табНЕРегламенты КАК табНЕРегламенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сметы КАК Сметы
	|		ПО (Сметы.ИД = табНЕРегламенты.ИД)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Ремонты.ID КАК ИД,
	|	МИНИМУМ(торо_Ремонты.ДатаНачалаФакт) КАК ФактДатаНач,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ НеРегламенты_ДатаНачалаФакт
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	(торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
	|			ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_АктОВыполненииЭтапаРабот)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_Ремонты.ID,
	|	торо_Ремонты.ВидРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.Регистратор КАК ДокАкт,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ID КАК ИД,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ДатаОкончания КАК ФактДатаКон,
	|	торо_ЗавершенныеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонта
	|ПОМЕСТИТЬ НеРегламенты_ДатаОкончанияФакт
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних КАК торо_ЗавершенныеРемонтныеРаботыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеРегламенты_ПлановыеДаты.РассчитыватьВремя КАК РассчитыватьВремя,
	|	НеРегламенты_ПлановыеДаты.ОбъектРемонта КАК ОбъектРемонта,
	|	НеРегламенты_ПлановыеДаты.ИД КАК ИД,
	|	НеРегламенты_ПлановыеДаты.ПланДатаНач КАК ПланДатаНач,
	|	НеРегламенты_ПлановыеДаты.ПланДатаКон КАК ПланДатаКон,
	|	ЕСТЬNULL(НеРегламенты_ДатаНачалаФакт.ФактДатаНач, НеРегламенты_ПлановыеДаты.ФактДатаНач) КАК ФактДатаНач,
	|	ЕСТЬNULL(НеРегламенты_ДатаОкончанияФакт.ФактДатаКон, НеРегламенты_ПлановыеДаты.ФактДатаКон) КАК ФактДатаКон,
	|	НеРегламенты_ПлановыеДаты.ДокИнициатор КАК ДокИнициатор,
	|	НеРегламенты_ПлановыеДаты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВЫБОР
	|		КОГДА НеРегламенты_ДатаОкончанияФакт.ВидРемонта ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(НеРегламенты_ДатаНачалаФакт.ВидРемонта, НеРегламенты_ПлановыеДаты.ВидРемонта)
	|		ИНАЧЕ НеРегламенты_ДатаОкончанияФакт.ВидРемонта
	|	КОНЕЦ КАК ВидРемонта,
	|	ЕСТЬNULL(НеРегламенты_ДатаОкончанияФакт.ДокАкт, НЕОПРЕДЕЛЕНО) КАК ДокАкт,
	|	ЕСТЬNULL(НеРегламенты_ПлановыеДаты.Смета, НЕОПРЕДЕЛЕНО) КАК Смета
	|ПОМЕСТИТЬ НеРегламентыОбщее
	|ИЗ
	|	НеРегламенты_ПлановыеДаты КАК НеРегламенты_ПлановыеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеРегламенты_ДатаНачалаФакт КАК НеРегламенты_ДатаНачалаФакт
	|		ПО НеРегламенты_ПлановыеДаты.ИД = НеРегламенты_ДатаНачалаФакт.ИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеРегламенты_ДатаОкончанияФакт КАК НеРегламенты_ДатаОкончанияФакт
	|		ПО НеРегламенты_ПлановыеДаты.ИД = НеРегламенты_ДатаОкончанияФакт.ИД
	|ГДЕ
	|	(НеРегламенты_ПлановыеДаты.ПланДатаНач МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ НеРегламенты_ПлановыеДаты.ПланДатаКон МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(НеРегламенты_ДатаНачалаФакт.ФактДатаНач, НеРегламенты_ПлановыеДаты.ФактДатаНач) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(НеРегламенты_ДатаОкончанияФакт.ФактДатаКон, НеРегламенты_ПлановыеДаты.ФактДатаКон) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ НеРегламенты_ПлановыеДаты.ДатаОбнаружения МЕЖДУ &ДатаНач И &ДатаКон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ табНЕРегламенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Сметы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламенты_ПлановыеДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламенты_ДатаНачалаФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламенты_ДатаОкончанияФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК ОбъектРемонта,
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК ИД,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ПланДатаНач,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ПланДатаКон,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаНач,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ФактДатаКон,
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК ДокИнициатор,
	|	торо_ПлановыеМероприятияСрезПоследних.Период КАК ДатаОбнаружения,
	|	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия КАК ВидРемонта
	|ПОМЕСТИТЬ Регламенты
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, &РассчетРеглМероприятий = ИСТИНА) КАК торо_ПлановыеМероприятияСрезПоследних
	|ГДЕ
	|	торо_ПлановыеМероприятияСрезПоследних.Отменен = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Ремонты.ID КАК ИД,
	|	МИНИМУМ(торо_Ремонты.ДатаНачалаФакт) КАК ФактДатаНач,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта
	|ПОМЕСТИТЬ РегламентыНаряды
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	(торо_Ремонты.Регистратор ССЫЛКА Документ.торо_НарядНаРегламентноеМероприятие
	|			ИЛИ торо_Ремонты.Регистратор ССЫЛКА Документ.торо_АктОВыполненииРегламентногоМероприятия)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_Ремонты.ОбъектРемонта,
	|	торо_Ремонты.ID,
	|	торо_Ремонты.ВидРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ЗавершенныеМероприятияСрезПоследних.ДатаОкончания КАК ФактДатаКон,
	|	торо_ЗавершенныеМероприятияСрезПоследних.Регистратор КАК ДокАкт,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ID КАК ИД,
	|	торо_ЗавершенныеМероприятияСрезПоследних.ВидМероприятия КАК ВидРемонта
	|ПОМЕСТИТЬ РегламентыАкты
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеМероприятия.СрезПоследних(, &РассчетРеглМероприятий = ИСТИНА) КАК торо_ЗавершенныеМероприятияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК РассчитыватьВремя,
	|	Регламенты.ОбъектРемонта КАК ОбъектРемонта,
	|	Регламенты.ИД КАК ИД,
	|	Регламенты.ПланДатаНач КАК ПланДатаНач,
	|	Регламенты.ПланДатаКон КАК ПланДатаКон,
	|	ЕСТЬNULL(РегламентыНаряды.ФактДатаНач, Регламенты.ФактДатаНач) КАК ФактДатаНач,
	|	ЕСТЬNULL(РегламентыАкты.ФактДатаКон, Регламенты.ФактДатаКон) КАК ФактДатаКон,
	|	Регламенты.ДокИнициатор КАК ДокИнициатор,
	|	Регламенты.ДатаОбнаружения КАК ДатаОбнаружения,
	|	ВЫБОР
	|		КОГДА РегламентыАкты.ВидРемонта ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(РегламентыНаряды.ВидРемонта, Регламенты.ВидРемонта)
	|		ИНАЧЕ РегламентыАкты.ВидРемонта
	|	КОНЕЦ КАК ВидРемонта,
	|	ЕСТЬNULL(РегламентыАкты.ДокАкт, НЕОПРЕДЕЛЕНО) КАК ДокАкт
	|ПОМЕСТИТЬ РегламентыОбщее
	|ИЗ
	|	Регламенты КАК Регламенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегламентыНаряды КАК РегламентыНаряды
	|		ПО Регламенты.ИД = РегламентыНаряды.ИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегламентыАкты КАК РегламентыАкты
	|		ПО Регламенты.ИД = РегламентыАкты.ИД
	|ГДЕ
	|	(Регламенты.ПланДатаНач МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ Регламенты.ПланДатаКон МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(РегламентыНаряды.ФактДатаНач, Регламенты.ФактДатаНач) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ ЕСТЬNULL(РегламентыАкты.ФактДатаКон, Регламенты.ФактДатаКон) МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ Регламенты.ДатаОбнаружения МЕЖДУ &ДатаНач И &ДатаКон)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Регламенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегламентыНаряды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегламентыАкты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеРегламентыОбщее.РассчитыватьВремя КАК РассчитыватьВремя,
	|	НеРегламентыОбщее.ОбъектРемонта КАК ОбъектРемонта,
	|	НеРегламентыОбщее.ИД КАК ИД,
	|	НеРегламентыОбщее.ПланДатаНач КАК ПланДатаНач,
	|	НеРегламентыОбщее.ПланДатаКон КАК ПланДатаКон,
	|	НеРегламентыОбщее.ФактДатаНач КАК ФактДатаНач,
	|	НеРегламентыОбщее.ФактДатаКон КАК ФактДатаКон,
	|	НеРегламентыОбщее.ДокИнициатор КАК ДокИнициатор,
	|	НеРегламентыОбщее.ДатаОбнаружения КАК ДатаОбнаружения,
	|	НеРегламентыОбщее.ВидРемонта КАК ВидРемонта,
	|	НеРегламентыОбщее.ДокАкт КАК ДокАкт,
	|	НеРегламентыОбщее.Смета КАК Смета
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	НеРегламентыОбщее КАК НеРегламентыОбщее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО НеРегламентыОбщее.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегламентыОбщее.РассчитыватьВремя,
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта,
	|	РегламентыОбщее.ИД,
	|	РегламентыОбщее.ПланДатаНач,
	|	РегламентыОбщее.ПланДатаКон,
	|	РегламентыОбщее.ФактДатаНач,
	|	РегламентыОбщее.ФактДатаКон,
	|	РегламентыОбщее.ДокИнициатор,
	|	РегламентыОбщее.ДатаОбнаружения,
	|	РегламентыОбщее.ВидРемонта,
	|	РегламентыОбщее.ДокАкт,
	|	NULL
	|ИЗ
	|	РегламентыОбщее КАК РегламентыОбщее
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО РегламентыОбщее.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|;
	#Вставка
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Документы.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_Документы.ФактДатаКон КАК ДатаОкончанияФакт
	|ПОМЕСТИТЬ ВТ_РазредОР
	|ИЗ
	|	Данные КАК ВТ_Документы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РазредОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_РазредОР.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	|	СУММА(торо_НаработкаОбъектовРемонта.Наработка) КАК Наработка
	|ПОМЕСТИТЬ СрезНаработки
	|ИЗ
	|	ВТ_РазредОР КАК ВТ_РазредОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
	|		ПО ВТ_РазредОР.ОбъектРемонта = торо_НаработкаОбъектовРемонта.ОбъектРемонта
	|			И ВТ_РазредОР.ДатаОкончанияФакт >= торо_НаработкаОбъектовРемонта.Период
	|			И (торо_НаработкаОбъектовРемонта.Показатель = ЗНАЧЕНИЕ(Справочник.ПараметрыВыработкиОС.гкс_ПоЧасам))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РазредОР.ОбъектРемонта,
	|	ВТ_РазредОР.ДатаОкончанияФакт
	|;
	#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеРегламентыОбщее
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегламентыОбщее
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.РассчитыватьВремя КАК РассчитыватьВремя,
	|	Данные.ОбъектРемонта КАК ОбъектРемонта,
	|	Данные.ИД КАК ИД,
	|	Данные.ПланДатаНач КАК ПлановаяДатаНачала,
	|	Данные.ПланДатаКон КАК ПлановаяДатаОкончания,
	|	Данные.ФактДатаНач КАК ФактическаяДатаНачала,
	|	Данные.ФактДатаКон КАК ФактическаяДатаОкончания,
	|	Данные.ДокИнициатор КАК ДокИнициатор,
	|	Данные.ДатаОбнаружения КАК ДатаОбнаружения,
	|	Данные.ВидРемонта КАК Ремонт,
	|	Данные.ДокАкт КАК ДокументАкт,
	|	ВЫБОР
	|		КОГДА Данные.ФактДатаКон <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ""Работы завершены""
	|		КОГДА Данные.ФактДатаНач <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ""Работы начаты""
	|		ИНАЧЕ ""Работы не начаты""
	|	КОНЕЦ КАК СтатусВыполнения,
	|	ВЫБОР
	|		КОГДА Данные.РассчитыватьВремя = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Данные.ФактДатаКон = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(Данные.ФактДатаНач, Данные.ФактДатаКон, СЕКУНДА), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДлительностьРемонта,
	|	ВЫБОР
	|		КОГДА Данные.РассчитыватьВремя = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Данные.ФактДатаКон = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(Данные.ДатаОбнаружения, Данные.ФактДатаКон, СЕКУНДА), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДлительностьУстраненияДефекта,
	|	ВЫБОР
	|		КОГДА Данные.РассчитыватьВремя = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Данные.ФактДатаНач = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(Данные.ДатаОбнаружения, Данные.ФактДатаНач, СЕКУНДА), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВремяРеакции,
	#Вставка
	|	СрезНаработки.Наработка КАК НаработкаАкта,
	|	Данные.ДокАкт.Комментарий КАК Комментарий,
	#КонецВставки
	|	Данные.Смета КАК Смета
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	Данные КАК Данные"
	#Вставка
	+ "
	|	ЛЕВОЕ СОЕДИНЕНИЕ СрезНаработки КАК СрезНаработки
	|	ПО (СрезНаработки.ОбъектРемонта = Данные.ОбъектРемонта)
	|		И (СрезНаработки.ДатаОкончанияФакт = Данные.ФактДатаКон) "
	#КонецВставки

	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ЗапросТекст = дс_ДобавитьПараметрыВТекстЗапроса(ЗапросТекст);
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

	Возврат ЗапросТекст;

КонецФункции
